<script setup lang="ts">
import * as echarts from 'echarts'

import chinaJson from './china.json' // 引入地图json文件

const chart = ref()
const option = ref({
  geo: [
    {
      map: 'china', // 使用注册的地图组件
      roam: true, // 是否可缩放
      left: 50, // 调整地图位置
      top: 50,
      right: 50,
      bottom: -50,
      label: {
        show: true, // 显示标签
        color: 'white',
        // backgroundColor: 'red',
      },
      itemStyle: {
        // 每一个区域图形块的样式,线性渐变
        color: {
          type: 'linear',
          x: 0,
          y: 0,
          x2: 0,
          y2: 1,
          colorStops: [
            {
              offset: 0,
              color: 'red', // 0% 处的颜色
            },
            {
              offset: 1,
              color: 'blue', // 100% 处的颜色
            },
          ],
          global: false, // 缺省为 false
        },
        opacity: 0.8,
        // areaColor: 'cyan', // 每一个区域的颜色
      },
      emphasis: {
        // 高亮状态
        itemStyle: {
          color: 'yellow',
        },
        label: {
          fontSize: 30,
        },
      },
    },
  ],

  series: [
    {
      type: 'lines', // 航线
      data: [
        {
          coords: [
            [116.405285, 39.904989], // 起点
            [102.712251, 25.040609], // 终点
          ],
          // 统一的样式设置
          lineStyle: {
            color: 'white', // 线的颜色
            type: 'dashed',
            width: 2, // 线的宽度
            curveness: 0.2, // 线的弯曲度
            opacity: 0.1, // 线的透明度
          },
        },
        {
          coords: [
            [123.429096, 41.796767], // 起点
            [91.132212, 29.660361], // 终点
          ],
          // 统一的样式设置
          lineStyle: {
            color: 'white', // 线的颜色
            type: 'dashed',
            width: 2, // 线的宽度
            curveness: -0.2, // 线的弯曲度
            opacity: 0.1, // 线的透明度
          },
        },
        {
          coords: [
            [119.306239, 26.075302], // 起点
            [87.617733, 43.792818], // 终点
          ],
          // 统一的样式设置
          lineStyle: {
            color: 'white', // 线的颜色
            type: 'dashed', // 线的类型
            width: 2, // 线的宽度
            curveness: -0.2, // 线的弯曲度
            opacity: 0.1, // 线的透明度
          },
        },
        {
          coords: [
            [91.132212, 29.660361], // 起点
            [115.892151, 28.676493], // 终点
          ],
          // 统一的样式设置
          lineStyle: {
            color: 'white', // 线的颜色
            type: 'dashed', // 线的类型
            width: 2, // 线的宽度
            curveness: 0.2, // 线的弯曲度
            opacity: 0.1, // 线的透明度
          },
        },
      ],
      effect: {
        // 线的特效
        show: true,
        color: 'pink', // 图形的颜色
        // delay: 2000, //延迟
        period: 3, // 特效动画的时间，单位为 s。
        symbol:
          'path://M700.065799 373.027761q116.507301 104.243374 209.508743 189.068865 39.857761 35.769785 77.671534 71.028574t67.451595 63.36362 47.522715 47.011718 17.884893 21.972868l0 61.319632q0 4.087975-17.884893-1.532991t-47.522715-17.373896-67.451595-27.593834-77.671534-33.214801q-93.001442-40.879755-209.508743-95.04543l0 193.156841q26.571841 19.417883 50.077699 37.813773 20.439877 15.329908 40.879755 30.148819t31.68181 22.994862q13.28592 9.197945 15.329908 18.906887t2.043988 22.994862l0 34.747791q0 8.175951-16.862899 10.730936t-40.368758-8.686948q-11.241933-6.131963-40.879755-18.39589t-63.36362-26.571841-64.896611-26.571841-46.500721-18.39589q-2.043988 0-3.576979-0.510997t-3.576979-0.510997-3.576979 0.510997-3.576979 0.510997q-15.329908 6.131963-46.500721 18.39589t-64.896611 26.571841-63.36362 26.571841-40.879755 18.39589q-23.505859 11.241933-40.368758 8.686948t-16.862899-10.730936l0-34.747791q0-13.28592 2.043988-22.994862t15.329908-18.906887q11.241933-8.175951 31.68181-22.994862t40.879755-30.148819q23.505859-18.39589 50.077699-37.813773l0-193.156841q-117.529295 54.165675-210.530737 95.04543-39.857761 17.373896-77.160537 33.214801t-66.940598 27.593834-47.522715 17.373896-17.884893 1.532991l0-61.319632q0-3.065982 17.884893-21.972868t47.522715-47.011718 66.940598-63.36362 77.160537-71.028574q93.001442-84.825491 210.530737-189.068865l0-231.992608q0-34.747791 10.219939-58.764647t25.549847-39.346764 33.214801-23.505859 33.725798-12.263926 26.060844-4.598972 11.241933-0.510997l10.219939 0q11.241933 1.021994 27.082837 5.109969t33.725798 12.263926 33.214801 23.505859 25.549847 39.346764 10.219939 58.764647l0 231.992608z', // 特效图形的样式。
        symbolSize: 25, // 特效图形的标记的大小
      },
    },
  ],
  grid: {
    // 布局位置
    top: 0,
    left: 0,
    bottom: 0,
    right: 0,
  },
})
onMounted(() => {
  const myChart = echarts.init(chart.value)
  echarts.registerMap('china', chinaJson)
  myChart.setOption(option.value)
})
</script>

<template>
  <div>
    <div ref="chart" class="w-full h-full" />
  </div>
</template>

<style scoped lang="scss"></style>
